OpenFOAMfiles/run/onlyOneTree/LAD1.4/LoD3/conifer_ex/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{
    wall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }

    y1
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }

    y0
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions"
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
